In [2]:
import pandas as pd

In [3]:
add_to_cart_df = pd.read_parquet('/home/kskim1001/ken/recsys/data/add_to_cart.parquet')

In [4]:
add_to_cart_df.head()

   client_id            timestamp      sku
0   17649961  2022-08-11 12:22:55  1398840
1     315805  2022-09-11 05:34:10  1434568
2     315805  2022-10-06 04:58:15   998226
3   16696114  2022-07-11 16:27:00    81192
4   10238779  2022-10-05 14:36:55  1475246

In [5]:
visit_df = pd.read_parquet('/home/kskim1001/ken/recsys/data/page_visit.parquet')

In [6]:
visit_df.shape

(150713186, 3)

In [7]:
visit_df.head(2)

   client_id            timestamp       url
0   13906876  2022-07-13 10:37:45  12160626
1   13906876  2022-08-11 18:13:20   9464384

In [8]:
product_df = pd.read_parquet('/home/kskim1001/ken/recsys/data/product_properties.parquet')

In [9]:
product_df.head(2)

      sku  category  price                                               name
0  510014      6350     58  [167  24 193  24  24  92 167  76  29  45 172 2...
1  925083      4750     25  [215 215 215 215 215 215 215 163 182 215  58 2...

In [10]:
product_df.shape

(1197634, 4)

In [11]:
visit_df.head(2)

   client_id            timestamp       url
0   13906876  2022-07-13 10:37:45  12160626
1   13906876  2022-08-11 18:13:20   9464384

In [12]:
visit_df['client_id'].nunique()

18614702